app/controllers/purchases_controller.rb

  def index
    @purchases = Purchase.all
---
SELECT "purchases".* FROM "purchases"

  def create
    @purchase = Purchase.new(purchase_params)

    respond_to do |format|
      if @purchase.save
---
INSERT INTO "purchases" ("name", "category", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "deep"], ["category", "1"], ["quantity", 50], ["created_at", "2020-01-10 10:12:33.377755"], ["updated_at", "2020-01-10 10:12:33.377755"]]

  def destroy
    @purchase.destroy
---
DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 3]]

  def destroy_all
    if params[:status] == true
      Purchase.destroy_all
---
DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 6]]

  def active_purchases
    @active_purchases = Purchase.all#where(status: 'active')
---
SELECT "purchases".* FROM "purchases"

    def set_purchase
      @purchase = Purchase.find(params[:id])
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]